{
  "0.2.0": {
    "en": "Reworked the app to make API requests directly instead of through the relay."
  },
  "0.1.0": {
    "en": "First version"
  },
  "0.1.2": {
    "en": "Updated the brand images."
  },
  "0.1.3": {
    "en": "Added better logging."
  },
  "0.3.0": {
    "en": "Added 'Other' driver for unsupported & exotic Tuya devices."
  },
  "0.4.0": {
    "en": "Added support for Fans, and added Tuya API Flow Cards."
  },
  "0.5.0": {
    "en": "Added support for online & offline events. Also named multi-switch events in the Timeline."
  },
  "0.6.0": {
    "en": "Added support for doorbells."
  },
  "0.7.0": {
    "en": "Added an information screen before pairing starts."
  },
  "1.0.0": {
    "en": "First release."
  },
  "1.0.1": {
    "en": "Add setting to scale socket power measurement"
  },
  "1.0.2": {
    "en": "Update app image"
  },
  "1.0.3": {
    "en": "Update app image"
  },
  "1.1.0": {
    "en": "Added method to retrieve device specifications from device settings"
  },
  "1.1.1": {
    "en": "Redact privacy sensitive fields from device specification"
  },
  "1.2.0": {
    "en": "Adds the new device classes camera, heater and dimmer. Switches can also be added using the socket device class. Light and socket device classes have been improved with additional capabilities and settings. Also adds support for flow triggers based on incoming Tuya status codes and starting Tuya scenes with a flow action."
  },
  "1.2.1": {
    "en": "Resolve pairing permission denied errors"
  },
  "1.2.2": {
    "en": "Improve relay_status handling, add device specification to all device types"
  },
  "1.2.3": {
    "en": "Improve relay_status handling, add device specification to all device types"
  },
  "1.3.0": {
    "en": "Add siren and climate sensor device support. Reworked fan device support. Add additional heater and dimmer device types. Added tamper alarm and battery percentage to sensors. Added manual alarm reset setting for contact/motion sensors. Added datapoint support to advanced flow cards. Improve status value scaling, correct scaling factors should be detected automatically and are customisable in the device settings. And several other smaller bugfixes and improvements."
  },
  "1.3.1": {
    "en": "Fix light device migration from older app versions, fix fan add when specifications are missing."
  },
  "1.3.2": {
    "en": "Ensure capability values are updated when scaling is changed, add missing child lock flow card to fan and socket devices."
  },
  "1.3.3": {
    "en": "Resolve issues with status updates"
  },
  "1.3.4": {
    "en": "Optimise pairing process"
  },
  "1.3.5": {
    "en": "Improve webhook data handling"
  },
  "1.4.0": {
    "en": "Add support for new device types: Circuit Breaker, Garage Door Opener, Human Presence Sensor, Thermostat, Water Valve, Window Coverings & Wireless Button. Improved Camera & Doorbell support."
  },
  "1.4.1": {
    "en": "Fix missing human alarm capability for Human Presence Sensor"
  },
  "1.4.2": {
    "en": "Add broken notice"
  }
}
